app/Models/ModelDosen.php

SELECT *
FROM `data_dosen`
---
    public function getdosen()
    {
        return $this->get();

SELECT *
FROM `data_dosen`
WHERE `userid` = 'S320023'
---
    public function getByUserId($userid)
    {
        return $this->where(['userid' => $userid])->get();

UPDATE `data_dosen` SET `nama` = 'Samba', `alamat` = 'Ajung', `email` = 'zizicomel02@gmail.com', `jenis_kelamin` = 'Laki-Laki'
WHERE `userid` = 'S320023'
---
    public function updateDosen($userid, $data)
    {

        if (empty($userid) || empty($data)) {
            return false;
        }


        return $this->where('userid', $userid)->set($data)->update();