app/Models/ModelSkripsi.php

    public function countApprovedSkripsi()
    {
        return $this->where('status', 'disetujui')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `skripsi`
WHERE `status` = 'disetujui'

    public function countAllSkripsi()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `skripsi`