app/Models/ModelUser.php

    public function cekuserid($userid)
    {
        return $this->where('userid', $userid)
            ->get();
---
SELECT *
FROM `user`
WHERE `userid` = 'E41202233'

    public function insert_user($data)
    {
        return $this->db->table($this->table)->insert($data);
---
INSERT INTO `user` (`userid`, `password`, `role`) VALUES ('10029000', 'hari', 'mahasiswa')

    public function getById($id)
    {
        return $this->where(['id' => $id])->get();
---
SELECT *
FROM `user`
WHERE `id` = '1'

    public function getByUserId($userid)
    {
        return $this->where(['userid' => $userid])->get();
---
SELECT *
FROM `user`
WHERE `userid` = 'S320023'

    public function updateUser($userid, $data)
    {

        if (empty($userid) || empty($data)) {
            return false;
        }


        return $this->where('userid', $userid)->set($data)->update();
---
UPDATE `user` SET `password` = 'Oke gas'
WHERE `userid` = 'S320023'