app/Models/ModelProposal.php

SELECT COUNT(*) AS `numrows` FROM `proposal`
---
    public function countAllProposals()
    {
        return $this->countAll();