app/Models/ModelAdmin.php

SELECT *
FROM `data_admin`
WHERE `userid` = 'E41202233'
---
    public function getByUserId($userid)
    {
        return $this->where(['userid' => $userid])->get();