app/Models/ModelMahasiswa.php

SELECT *
FROM `data_mahasiswa`
---
    public function getMahasiswa()
    {
        return $this->get();

INSERT INTO `data_mahasiswa` (`userid`, `nama`, `alamat`, `email`, `jenis_kelamin`, `jurusan`) VALUES ('10029000', 'Hariyanto', 'Badung', 'hariyanto@gmail.com', 'Laki-Laki', 'TI')
---
    public function insert_mahasiswa($data)
    {
        return $this->db->table($this->table)->insert($data);

SELECT COUNT(*) AS `numrows` FROM `data_mahasiswa`
---
    public function countAllMahasiswa()
    {
        return $this->countAll();